app/views/users/show.html.erb


    <% if @user.events.empty? %>
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 2]]
SELECT 1 AS one FROM "events" WHERE "events"."user_id" = ? LIMIT ?  [["user_id", 7], ["LIMIT", 1]]


        <% @user.events.each do |e| %>
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]


    <% if @user.rsvps.empty? %>
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "rsvps" WHERE "rsvps"."user_id" = ? LIMIT ?  [["user_id", 7], ["LIMIT", 1]]


        <% @user.rsvps.each do |e| %>
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."user_id" = ?  [["user_id", 1]]