app/views/events/_category_select.html.erb

        <%= f.label :category, "Choose a Category" %><br><br>
        <%= f.collection_select :category_id, Category.all, :id, :name, {include_blank: true}, { class: 'uk-select' } %><br><br>
---
SELECT "categories".* FROM "categories"