app/views/events/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <%= f.label :category, "Choose a Category" %><br><br>
      <%= f.collection_select :category_id, Category.all, :id, :name, {prompt: true}, { class: 'uk-select' } %><br><br>