app/views/events/_form.html.erb

SELECT "categories".* FROM "categories"
---

  <%= f.collection_select :category_id, Category.all, :id, :name %>