app/controllers/events_controller.rb

    def new
        if params[:category_id] && @category = Category.find_by_id(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]