app/controllers/events_controller.rb

    def create
        if @category
            @event = @category.events.build(event_params)
            @event.user = current_user
        else
            @event = current_user.events.build(event_params)
        end
        if @event.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hiking"], ["created_at", "2021-02-04 18:39:26.176304"], ["updated_at", "2021-02-04 18:39:26.176304"]]
INSERT INTO "events" ("name", "description", "start_date", "end_date", "start_time", "end_time", "user_id", "created_at", "updated_at", "location", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        @category
        if @event.update(event_params)
---
UPDATE "events" SET "end_time" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["end_time", "2000-01-01 20:00:00"], ["updated_at", "2021-02-15 05:30:06.980109"], ["id", 12]]

    def most_popular
        @events = Event.most_rsvps.future.ordered_by_date.limit(3)
---
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."event_id" = ?  [["event_id", 12]]

    def set_event
        @event = Event.find_by_id(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def find_category
        @category = Category.find_by_id(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]