app/controllers/rsvps_controller.rb

    def new
        if params[:event_id] && !Event.exists?(params[:event_id])
            redirect_to events_path, alert: "Event not found."
        else
            @event = Event.find_by_id(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @event = Event.find_by_id(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]