app/controllers/rsvps_controller.rb

INSERT INTO "rsvps" ("status", "number_of_attendees", "user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["status", "Interested"], ["number_of_attendees", 1], ["user_id", 1], ["event_id", 12], ["created_at", "2021-02-15 05:21:52.384790"], ["updated_at", "2021-02-15 05:21:52.384790"]]
---
    def create
      @rsvp = Rsvp.new(rsvp_params)
      @rsvp.user_id = current_user.id
      @event = @rsvp.event
      if @rsvp.save

UPDATE "rsvps" SET "status" = ?, "number_of_attendees" = ?, "updated_at" = ? WHERE "rsvps"."id" = ?  [["status", "Attending"], ["number_of_attendees", 1], ["updated_at", "2021-02-15 05:30:29.098802"], ["id", 7]]
---
    def update
      if @rsvp.update(rsvp_params)

SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_rsvp
        @rsvp = Rsvp.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_event
      @event = Event.find_by_id(params[:id])