app/controllers/sessions_controller.rb

    def omniauth
        user = User.from_omniauth(auth)
        if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "uid", "provider") VALUES (?, ?, ?, ?, ?, ?, ?)