app/models/event.rb

    def category_attributes=(attr)
        if !attr[:name].blank?
            self.category = category.find_or_create_by(name: attr[:name], owner: attr[:owner])
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Mardi Gras"], ["created_at", "2021-02-13 17:16:20.492489"], ["updated_at", "2021-02-13 17:16:20.492489"]]
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Mardi Gras"], ["LIMIT", 1]]