app/models/user.rb

    def self.from_omniauth(response)
        User.find_or_create_by(uid: response[:uid], provider: response["provider"]) do |u|
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "uid", "provider") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."uid" = ? AND "users"."provider" = ? LIMIT ?  [["uid", "117412975562228641600"], ["provider", "google_oauth2"], ["LIMIT", 1]]