app/views/categories/show.html.erb


    <% if @category.events.empty? %>
---
SELECT "events".* FROM "events" WHERE "events"."category_id" = ?  [["category_id", 1]]
SELECT 1 AS one FROM "events" WHERE "events"."category_id" = ? LIMIT ?  [["category_id", 14], ["LIMIT", 1]]


        <% @category.events.each do |e| %>
---
SELECT "events".* FROM "events" WHERE "events"."category_id" = ?  [["category_id", 10]]